In [3]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\nastea\appdata\local\programs\python\python311\lib\site-packages (2.2.1)
Requirement already satisfied: numpy<2,>=1.23.2 in c:\users\nastea\appdata\local\programs\python\python311\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\nastea\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\nastea\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\nastea\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\nastea\appdata\local\programs\python\python311\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [4]:
# importam pandas
import pandas as pd 
import numpy as np

## Data Frames

In [5]:
forum_users = {
    'User ID':np.array([1, 2, 3, 4, 5]), # Putem sa folosim masive numpay pnetru creaea DataFrame
    'Username':['andrew_b', 'ion_a', 'jane_smith', 'alex123', 'bob56'],
    'Age':[34, 53, 24, 16, 65],
    'Joined Date':pd.to_datetime(['2021-01-10', '2022-03-14', '2020-01-24', '2023-03-26', '2018-11-25']),
    'Total Post':[150, 300, 250, 30, 90],
    'Reputation':[500, 720, 600, 300, 980]
}

# Creem DataFrames 

df = pd.DataFrame(forum_users)
df

   User ID    Username  Age Joined Date  Total Post  Reputation
0        1    andrew_b   34  2021-01-10         150         500
1        2       ion_a   53  2022-03-14         300         720
2        3  jane_smith   24  2020-01-24         250         600
3        4     alex123   16  2023-03-26          30         300
4        5       bob56   65  2018-11-25          90         980

In [6]:
df.shape

(5, 6)

In [7]:
type(df)

pandas.core.frame.DataFrame

In [8]:
# afisham metkile pentru fiecare coloana
df.columns

Index(['User ID', 'Username', 'Age', 'Joined Date', 'Total Post',
       'Reputation'],
      dtype='object')

In [9]:
type(df.columns)

pandas.core.indexes.base.Index

In [10]:
# convertam in lista
df.columns.tolist()

['User ID', 'Username', 'Age', 'Joined Date', 'Total Post', 'Reputation']

In [11]:
# afisham rindurile di DataFrame
df.index.tolist()

[0, 1, 2, 3, 4]

In [12]:
df.dtypes

User ID                 int32
Username               object
Age                     int64
Joined Date    datetime64[ns]
Total Post              int64
Reputation              int64
dtype: object

In [13]:
df.values
# values - ne da noua tabel bi-deminsional din 'numpy'

array([[1, 'andrew_b', 34, Timestamp('2021-01-10 00:00:00'), 150, 500],
       [2, 'ion_a', 53, Timestamp('2022-03-14 00:00:00'), 300, 720],
       [3, 'jane_smith', 24, Timestamp('2020-01-24 00:00:00'), 250, 600],
       [4, 'alex123', 16, Timestamp('2023-03-26 00:00:00'), 30, 300],
       [5, 'bob56', 65, Timestamp('2018-11-25 00:00:00'), 90, 980]],
      dtype=object)

In [14]:
type(df.values)

numpy.ndarray

In [15]:
df.values[0,1]

'andrew_b'

In [16]:
# Afisham primele 3 rinduri cu head(3)
# Metoda head() nu schimba DataFrame originala
df.head(3)

   User ID    Username  Age Joined Date  Total Post  Reputation
0        1    andrew_b   34  2021-01-10         150         500
1        2       ion_a   53  2022-03-14         300         720
2        3  jane_smith   24  2020-01-24         250         600

In [17]:
# Afisham de la coada deja, ultimile 2
df.tail(2)

   User ID Username  Age Joined Date  Total Post  Reputation
3        4  alex123   16  2023-03-26          30         300
4        5    bob56   65  2018-11-25          90         980

In [18]:
df.describe()

        User ID        Age          Joined Date  Total Post  Reputation
count  5.000000   5.000000                    5    5.000000    5.000000
mean   3.000000  38.400000  2021-01-30 19:12:00  164.000000  620.000000
min    1.000000  16.000000  2018-11-25 00:00:00   30.000000  300.000000
25%    2.000000  24.000000  2020-01-24 00:00:00   90.000000  500.000000
50%    3.000000  34.000000  2021-01-10 00:00:00  150.000000  600.000000
75%    4.000000  53.000000  2022-03-14 00:00:00  250.000000  720.000000
max    5.000000  65.000000  2023-03-26 00:00:00  300.000000  980.000000
std    1.581139  20.305172                  NaN  111.265448  253.377189

In [19]:
df.describe().round(2)

       User ID    Age          Joined Date  Total Post  Reputation
count     5.00   5.00                    5        5.00        5.00
mean      3.00  38.40  2021-01-30 19:12:00      164.00      620.00
min       1.00  16.00  2018-11-25 00:00:00       30.00      300.00
25%       2.00  24.00  2020-01-24 00:00:00       90.00      500.00
50%       3.00  34.00  2021-01-10 00:00:00      150.00      600.00
75%       4.00  53.00  2022-03-14 00:00:00      250.00      720.00
max       5.00  65.00  2023-03-26 00:00:00      300.00      980.00
std       1.58  20.31                  NaN      111.27      253.38

In [20]:
df.select_dtypes(include='object')

     Username
0    andrew_b
1       ion_a
2  jane_smith
3     alex123
4       bob56

In [21]:
df.select_dtypes(exclude='object')

   User ID  Age Joined Date  Total Post  Reputation
0        1   34  2021-01-10         150         500
1        2   53  2022-03-14         300         720
2        3   24  2020-01-24         250         600
3        4   16  2023-03-26          30         300
4        5   65  2018-11-25          90         980

In [22]:
df.select_dtypes(exclude=['object', 'int64'])

   User ID Joined Date
0        1  2021-01-10
1        2  2022-03-14
2        3  2020-01-24
3        4  2023-03-26
4        5  2018-11-25

In [23]:
df.select_dtypes(include='object').columns

Index(['Username'], dtype='object')

In [24]:
df.select_dtypes(include='int64')

   Age  Total Post  Reputation
0   34         150         500
1   53         300         720
2   24         250         600
3   16          30         300
4   65          90         980

In [25]:
df.isna() 
# isna- is not avaibale, controlom daca vreo celula nare incriptii este goala

   User ID  Username    Age  Joined Date  Total Post  Reputation
0    False     False  False        False       False       False
1    False     False  False        False       False       False
2    False     False  False        False       False       False
3    False     False  False        False       False       False
4    False     False  False        False       False       False

In [26]:
df.isna().sum()

User ID        0
Username       0
Age            0
Joined Date    0
Total Post     0
Reputation     0
dtype: int64

## Series

In [27]:
username_series = df['Username']
username_series

0      andrew_b
1         ion_a
2    jane_smith
3       alex123
4         bob56
Name: Username, dtype: object

In [28]:
type(username_series)

pandas.core.series.Series

In [29]:
username_series.values

array(['andrew_b', 'ion_a', 'jane_smith', 'alex123', 'bob56'],
      dtype=object)

In [30]:
type(username_series.values)

numpy.ndarray

In [31]:
username_series.index

RangeIndex(start=0, stop=5, step=1)

In [33]:
# Primim o serie de date
username_series.value_counts()

Username
andrew_b      1
ion_a         1
jane_smith    1
alex123       1
bob56         1
Name: count, dtype: int64

In [35]:
df['Reputation'].value_counts()

Reputation
500    1
720    1
600    1
300    1
980    1
Name: count, dtype: int64

In [36]:
df['Reputation'].unique()

array([500, 720, 600, 300, 980], dtype=int64)

In [38]:
df['Reputation'].sort_values()

3    300
0    500
2    600
1    720
4    980
Name: Reputation, dtype: int64

In [40]:
df['Reputation'].sort_values(ascending=False)

4    980
1    720
2    600
0    500
3    300
Name: Reputation, dtype: int64

In [37]:
username_series.sort_values()

3       alex123
0      andrew_b
4         bob56
1         ion_a
2    jane_smith
Name: Username, dtype: object

In [41]:
username_series.sort_values(ascending=False)

2    jane_smith
1         ion_a
4         bob56
0      andrew_b
3       alex123
Name: Username, dtype: object